//Напишите программу, которая преобразовывает текст из входного текстового файла 
//в азбуку Морзе и наоборот. Полученный текст сохраняется в отдельный файл.

#include <iostream>
#include <fstream>
#include <string>
using namespace std;

const char alphabet[80] =
{
	'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
	'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
	'u', 'v', 'w', 'x', 'y', 'z', 'a', 'б', 'в', 'г',
	'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н',
	'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч',
	'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', '1', '2',
	'3', '4', '5', '6', '7', '8', '9', '0', '.', ',',
	'!', '?', ';', ':', '-', '(', ')', '/', '\"', '\''
};

const string morse_code[80] = 
{
	"*-",		"-***",		"-*-*",		"-**",		"*",		"**-*",		"--*",		"****",		"**",		"*---",
	"-*-",		"*-**",		"--",		"-*",		"---",		"*--*",		"--*-",		"*-*",		"***",		"-",
	"**-",		"***-",		"*--",		"-**-",		"-*--",		"--**",		"*-",		"-***",		"*--",		"--*",
	"-**",		"*",		"***-",		"--**",		"**",		"*---",		"-*-",		"*-**",		"--",		"-*",
	"---",		"*--*",		"*-*",		"***",		"-",		"**-",		"**-*",		"****",		"-*-*",		"---*",
	"----",		"--*-",		"--*--",	"-*--",		"-**-",		"**-**",	"**--",		"*-*-",		"*----",	"**---",
	"***--",	"****-",	"*****",	"-****",	"--***",	"---**",	"----*",	"-----",	"******",	"*-*-*-",
	"--**--",	"**--**",	"-*-*-*",	"---***",	"*-**-*",	"*----*",	"-****-",	"-*--*",	"-*--*-",	"-**-*"
};


int main()
{
	system("chcp 1251 > 0");

	cout << "Кодирование и раскодирование сообщения с помощью азбуки Морзе" << endl;
	cout << "==================================================================" << endl << endl;
	cout << "Для текстового файла разрешены следующие символы:" << endl;
	cout << "1) Латинские символы:" << endl;
	cout << "a b c d e f g h i g k l m n o p q r s t u v w x y z" << endl;
	cout << "2) Русские символы:" << endl;
	cout << "а б в г д е ж з и й к л м н о п р с т у ф х ц ч ш щ ъ ы ь э ю я" << endl;
	cout << "3) Цифры и специальные символы:" << endl;
	cout << "1 2 3 4 5 6 7 8 9 0 . , ! ? ; : - ( ) / \" \'" << endl << endl;
	cout << "Правила написания сообщения в кодах Морзе:" << endl;
	cout << "1) Символы одной буквы пишутся слитно" << endl;
	cout << "2) Между буквами оного слова ставится 1 пробел" << endl;
	cout << "3) Между словами ставится 3 пробела" << endl << endl;

	system("pause");
	return 0;
}